import pandas as pd
from datetime import datetime, timedelta

base_time = datetime.now()

inventory_logs = pd.DataFrame([
    {
        "날짜": "2025-06-01 08:45",
        "품목명": "스테인리스 2.0T",
        "구분": "입고",
        "수량": 150,
        "입고단가": 3100,
        "예상출고단가": 3950,
        "출고단가": 0,
        "마진율": "",
        "납품업체명": "한일강업",
        "담당자명": "김유진",
        "비고": "정기 계약 입고"
    },
    {
        "날짜": "2025-06-03 15:10",
        "품목명": "스테인리스 2.0T",
        "구분": "출고",
        "수량": 70,
        "입고단가": 3100,
        "예상출고단가": "",
        "출고단가": 4000,
        "마진율": 29.03,
        "납품업체명": "한일강업",
        "담당자명": "이승호",
        "비고": "소형 공장 납품"
    },
    {
        "날짜": "2025-06-04 13:30",
        "품목명": "동판 0.5T",
        "구분": "입고",
        "수량": 80,
        "입고단가": 4800,
        "예상출고단가": 5700,
        "출고단가": 0,
        "마진율": "",
        "납품업체명": "금강소재",
        "담당자명": "정다혜",
        "비고": "신규 아이템"
    },
    {
        "날짜": "2025-06-05 09:50",
        "품목명": "동판 0.5T",
        "구분": "출고",
        "수량": 40,
        "입고단가": 4800,
        "예상출고단가": "",
        "출고단가": 5600,
        "마진율": 16.67,
        "납품업체명": "금강소재",
        "담당자명": "장지훈",
        "비고": "초도 공급"
    },

    {
        "날짜": "2025-06-05 10:15",
        "품목명": "알루미늄 0.8T",
        "구분": "입고",
        "수량": 200,
        "입고단가": 2200,
        "예상출고단가": 2900,
        "출고단가": 0,
        "마진율": "",
        "납품업체명": "동서금속",
        "담당자명": "홍길동",
        "비고": "신규 자재 입고"
    },
    {
        "날짜": "2025-06-08 16:20",
        "품목명": "알루미늄 0.8T",
        "구분": "출고",
        "수량": 80,
        "입고단가": 2200,
        "예상출고단가": "",
        "출고단가": 2800,
        "마진율": 27.27,
        "납품업체명": "동서금속",
        "담당자명": "홍길",
        "비고": "대형 수주 납품"
    },
    {
        "날짜": "2025-06-09 10:00",
        "품목명": "철판 1.2T",
        "구분": "입고",
        "수량": 100,
        "입고단가": 1200,
        "예상출고단가": 1800,
        "출고단가": 0,
        "마진율": "",
        "납품업체명": "ABC상사",
        "담당자명": "홍길동",
        "비고": "초기 입고"
    },
    {
        "날짜": "2025-06-10 11:00",
        "품목명": "철판 1.2T",
        "구분": "출고",
        "수량": 20,
        "입고단가": 1200,
        "예상출고단가": "",
        "출고단가": 1900,
        "마진율": 58.33,
        "납품업체명": "ABC상사",
        "담당자명": "이철수",
        "비고": "초도 납품"
    }
])
